<template>
  <div>
    <a-layout id="components-layout-demo-custom-trigger">
      <a-layout-sider v-model="collapsed" :trigger="null" collapsible>
        <!--      <div class="logo" />-->
        <div id="box1">
          <p v-show="collapsed">xxx</p>
          <p v-show="collapsed == false">xxx</p>
        </div>
        <a-menu theme="dark" mode="inline" :default-selected-keys="[key]" id="menu">

          <a-menu-item key="1" @click="run1()">
            <div class="icon2">
              <svg t="1626847235878" class="icon" viewBox="0 0 1024 1024" version="1.1" xmlns="http://www.w3.org/2000/svg" p-id="3728" width="16" height="16"><path d="M422.399 601.6V493.323c-79.111-34.622-134.4-113.655-134.4-205.323 0-123.711 100.54-224 224-224 123.711 0 224 100.545 224 224 0 91.814-55.379 170.725-134.4 205.313V601.6h201.472c61.925 0 112.128 49.716 112.128 112.003V825.6H108.801V713.598c0-61.855 50.444-111.998 112.126-111.998h201.472zM153.601 870.4h716.793V960H153.6v-89.6z" p-id="3729" fill="#ffffff"></path></svg>
            </div>
            <span v-show="collapsed===false">审批回复
                <p style="margin-left:-20px;text-align:center;vertical-align:middle;line-height:14px;font-size: 8px;height:14px;background-color:red;border-radius: 7px;width:14px;float:right;margin-top:5px;z-index:1000">5</p>
              </span>
          </a-menu-item>
          <a-menu-item key="2" @click="run2()">
            <div class="icon2">
              <svg t="1626847310550" class="icon" viewBox="0 0 1024 1024" version="1.1" xmlns="http://www.w3.org/2000/svg" p-id="4690" width="16" height="16"><path d="M898.34 188.81L538.35 74.51l-359.87 114.3c-13.53 4.27-22.67 16.86-22.55 31.1v454.94c0.72 3.09 17.69 77.98 91.27 150.5 56.61 55.78 192.4 127.48 251.63 158.57 9.25 4.87 13.65 6.65 17.56 8.78l17.57 8.78c4.63 2.49 12.94 2.38 17.57 0l17.57-8.78c34.65-16.97 195-102.9 260.4-167.35 73.71-72.52 90.68-147.41 91.39-150.5V219.91c0.23-14.24-9.02-26.83-22.55-31.1zM542.86 930.98l-0.24-0.12h0.59c-0.23 0.12-0.35 0.12-0.35 0.12z m85.81-264.32h-58.16v81.9c0 18.99-15.43 34.42-34.42 34.42-18.99 0-34.42-15.43-34.42-34.42V537.29c0-0.71 0.12-1.3 0.12-1.9-6.29-1.9-12.58-4.16-18.87-7-21.24-9.73-39.4-27.18-51.51-47-12.58-20.65-19.23-46.53-17.21-70.74 2.37-27.65 12.34-51.75 30.03-73.23 30.62-37.15 86.88-52.22 131.98-35.73 25.52 9.38 46.29 25.05 61.96 47.12 13.77 19.35 20.77 43.44 21.37 67.06 0 0.71 0.12 1.3 0 2.02 0 0.83 0 1.66-0.12 2.49-1.66 52.46-37.74 101.95-89.02 115.61v60.41h58.16c18.99 0 34.42 15.43 34.42 34.42v1.42h0.12c-0.01 18.99-15.44 34.42-34.43 34.42z" p-id="4691" fill="#ffffff"></path><path d="M577.99 449.1c0.35-0.59 0.71-1.07 0.83-1.19a97.38 97.38 0 0 0 5.58-9.74c1.54-4.39 2.73-8.78 3.68-13.41 0.12-2.25 0.24-4.63 0.36-6.89 0-2.26-0.12-4.63-0.36-6.88-0.83-4.51-2.14-9.02-3.68-13.41a108.73 108.73 0 0 0-4.51-8.19c-0.36-0.36-1.19-1.54-2.61-3.8-1.3-1.43-2.61-2.97-4.03-4.27-1.66-1.66-3.44-3.32-5.34-4.87-0.59-0.35-1.06-0.71-1.19-0.83a97.226 97.226 0 0 0-9.73-5.58c-4.39-1.54-8.78-2.73-13.29-3.68-4.63-0.35-9.26-0.35-13.89 0-4.51 0.83-9.02 2.14-13.29 3.68a108.73 108.73 0 0 0-8.19 4.51c-0.36 0.36-1.54 1.19-3.8 2.61-1.43 1.3-2.97 2.61-4.27 4.03-1.66 1.66-3.32 3.44-4.87 5.34-0.35 0.59-0.71 1.07-0.83 1.19a97.226 97.226 0 0 0-5.58 9.73c-1.54 4.39-2.73 8.78-3.68 13.29-0.35 4.63-0.35 9.26 0 13.89 0.83 4.51 2.14 9.02 3.68 13.29 1.42 2.85 2.85 5.46 4.51 8.19 0.36 0.36 1.19 1.54 2.61 3.8 1.3 1.43 2.61 2.97 4.03 4.27 1.66 1.66 3.44 3.32 5.34 4.87 0.59 0.35 1.07 0.71 1.19 0.83 3.08 2.02 6.41 3.92 9.73 5.58 4.39 1.54 8.78 2.73 13.29 3.68 4.63 0.36 9.26 0.36 13.89 0 4.51-0.83 9.02-2.14 13.29-3.68 2.85-1.42 5.46-2.85 8.19-4.51 0.36-0.36 1.54-1.19 3.8-2.61 1.54-1.19 2.97-2.49 4.27-3.92 1.67-1.64 3.33-3.42 4.87-5.32z" p-id="4692" fill="#ffffff"></path></svg>
            </div>
            <span v-show="collapsed===false">分配权限</span>
          </a-menu-item>
          <a-menu-item key="3" @click="run3()">
            <div class="icon2">
              <svg t="1626767833570" class="icon" viewBox="0 0 1024 1024" version="1.1" xmlns="http://www.w3.org/2000/svg" p-id="8518" width="17" height="17"><path d="M718.421333 593.664c81.28 31.146667 134.912 88.661333 134.912 175.658667v90.581333c0 43.52-35.285333 78.762667-78.762666 78.762667H249.429333A78.762667 78.762667 0 0 1 170.666667 859.904V769.28c0-87.04 53.632-144.512 134.912-175.658667a37.077333 37.077333 0 0 1 39.850666 8.746667c4.906667 5.034667 9.130667 9.088 12.714667 12.16A235.392 235.392 0 0 0 512 671.488a235.434667 235.434667 0 0 0 157.781333-60.373333c2.56-2.304 5.546667-5.205333 8.96-8.704a36.906667 36.906667 0 0 1 39.68-8.746667zM512 128a196.906667 196.906667 0 0 1 196.906667 196.906667V415.573333a196.906667 196.906667 0 0 1-393.813334 0V324.906667A196.906667 196.906667 0 0 1 512 128z" fill="#ffffff" p-id="8519"></path></svg>
            </div>
            <span v-show="collapsed===false">个人信息</span>
          </a-menu-item>
        </a-menu>
      </a-layout-sider>
      <a-layout>
        <a-layout-header style="background: #03152a; padding: 0">
          <a-icon
              id="icon1"
              class="trigger"
              :type="collapsed ? 'menu-unfold' : 'menu-fold'"
              @click="() => (collapsed = !collapsed)"
          />
          <svg @click="back()" style="float:right;margin-right:30px;margin-top:20px" t="1626767895315" class="icon" viewBox="0 0 1027 1024" version="1.1" xmlns="http://www.w3.org/2000/svg" p-id="9395" width="20" height="20"><path d="M584.470443 677.918c-3.66 0-6.515 0-9.36 0-97.805 0-195.607 0.01-293.414 0-14.5-0.005-23.95-6.65-26.28-18.54-0.458-2.375-0.415-4.87-0.415-7.3-0.018-86.915-0.02-173.825-0.012-260.739 0.003-16.485 8.93-25.255 25.672-25.255 98.247-0.005 196.497-0.005 294.749-0.005 2.645 0 5.31 0 9.06 0 0-2.82 0-5.362 0-7.912 0-77.352-0.01-154.71 0.01-232.069 0-10.645 5.075-19.135 13.67-22.387 9.89-3.745 18.665-2.02 26.12 5.857 4.275 4.517 8.93 8.672 13.32 13.065 55.385 55.265 110.76 110.555 166.13 165.82 71.12 70.965 142.245 141.912 213.365 212.874 11.84 11.802 11.905 24.252 0.205 35.927-101.78 101.605-203.549 203.219-305.359 304.784-28.955 28.885-58.065 57.595-86.995 86.505-7.445 7.45-15.75 10.715-25.915 6.855-9.885-3.75-14.54-11.53-14.54-23.765-0.015-74.905-0.01-149.82-0.01-224.724C584.470443 684.263 584.470443 681.623 584.470443 677.918zM401.643443 106.172c0 29.415 0 58.215 0 87.827-2.882 0-5.477 0-8.07 0-74.465 0-148.93-0.01-223.394 0.005-47.187 0.007-81.935 34.827-81.937 82.107-0.007 163.602 0.293 327.202-0.197 490.791-0.135 43.285 32.795 74.47 63.24 80.165 6.727 1.245 13.677 1.81 20.525 1.825 73.797 0.13 147.597 0.08 221.397 0.08 2.622 0 5.247 0 8.302 0 0 29.325 0 58.115 0 87.325-1.05 0.21-2.275 0.68-3.503 0.68-78.467 0-156.942 0.8-235.389-0.34-76.67-1.1-144.565-59.285-159.197-134.595-2.065-10.61-3.075-21.595-3.087-32.405-0.19-165.385-0.627-330.762 0.102-496.134 0.305-69.077 34.625-118.665 94.56-150.892 21.145-11.375 44.502-16.512 68.577-16.572 77.797-0.21 155.595-0.08 233.394-0.075C398.281443 105.965 399.593443 106.08 401.643443 106.172z" p-id="9396" fill="#ffffff"></path></svg>
        </a-layout-header>
        <!--      面包屑导航-->
        <div id="bread">
          <a-breadcrumb>
            <a-breadcrumb-item href="">
              <a-icon type="home" />
<!--              <span>审批回复</span>-->
            </a-breadcrumb-item>
            <!--          <a-breadcrumb-item href="">-->
            <!--            <a-icon type="user" />-->
            <!--            <span>Application List</span>-->
            <!--          </a-breadcrumb-item>-->
            <!--          <a-breadcrumb-item>-->
            <!--            Application-->
            <!--          </a-breadcrumb-item>-->
          </a-breadcrumb>
        </div>

        <a-layout-content
            :style="{ margin: '24px 16px', padding: '24px', background: '#fff', minHeight: '850px' }"
        >
        </a-layout-content>
      </a-layout>
    </a-layout>
    <a-layout-footer style="background-color: #03152a;height:24px;padding:0px;color:white"><div style="width:18.67px;margin:auto"><span style="text-align: center;margin:auto">@copyright</span></div></a-layout-footer>
  </div>
</template>

<script>
import zh_CN from "_ant-design-vue@1.7.6@ant-design-vue/lib/locale-provider/zh_CN";

export default {
  name: "manager",
  data() {
    return {
      key:this.$route.params.key,
      radioStyle: {
        display: 'block',
        height: '30px',
        lineHeight: '30px',
      },
      zh_CN,
      collapsed: false,
    };
  },
  created(){
    console.log(this.key)
    if(this.key == undefined){
      this.key = '1'
      console.log(this.key)
    }
    console.log(this.key)
  },
  methods:{
    back() {
      this.$router.push({ name: 'manager' })
    },
    run1(){
      console.log("111")
      this.key='1'
      console.log(this.key)
      this.$router.push({ name: 'return',params: { key: this.key }  })
      this.key='1'
    },
    run2(){
      console.log("111")
      this.key='2'
      console.log(this.key)
      this.$router.push({ name: 'authority',params: { key: this.key }  })
      this.key='2'
    },
    run3(){
      console.log("111")
      this.key='3'
      console.log(this.key)
      this.$router.push({ name: 'man_personal',params: { key: this.key }  })
      this.key='3'
    },
  }
}
</script>

<style scoped>

</style>
